test/good/string-receivers-overlap.cfg.dot
digraph "string-receivers-overlap" {
    node [shape=box];
    subgraph "cluster_Test__receive_internal_comment_1660_test" {
        label="Test__receive_internal_comment_1660_test";
    }
    subgraph "cluster_Test__receive_internal_simple_1720" {
        label="Test__receive_internal_simple_1720";
        "Test__receive_internal_simple_1720_142" [label="if (msg == \"test\")"];
        "Test__receive_internal_simple_1720_143" [label="if (\"test\" != msg)"];
        "Test__receive_internal_simple_1720_145" [label="if (\"test\" != msg && WHATEVER)"];
        "Test__receive_internal_simple_1720_147" [label="if ((WHATEVER || WHATEVER) && \"test\" != msg)"];
        "Test__receive_internal_simple_1720_149" [label="let foo: String = msg"];
        "Test__receive_internal_simple_1720_151" [label="let bar = foo"];
        "Test__receive_internal_simple_1720_153" [label="if (\"test\" == bar)"];
        "Test__receive_internal_simple_1720_155" [label="let test1: String = \"test\""];
        "Test__receive_internal_simple_1720_157" [label="let test2 = test1"];
        "Test__receive_internal_simple_1720_159" [label="if (test2 == msg)"];
        "Test__receive_internal_simple_1720_161" [label="if (test2 != bar)"];
        "Test__receive_internal_simple_1720_163" [label="if (bar == test2)"];
        "Test__receive_internal_simple_1720_165" [label="if (\"test\" != a)",style=filled,fillcolor="#66A7DB"];
        "Test__receive_internal_simple_1720_142" -> "Test__receive_internal_simple_1720_143";
        "Test__receive_internal_simple_1720_143" -> "Test__receive_internal_simple_1720_145";
        "Test__receive_internal_simple_1720_145" -> "Test__receive_internal_simple_1720_147";
        "Test__receive_internal_simple_1720_147" -> "Test__receive_internal_simple_1720_149";
        "Test__receive_internal_simple_1720_149" -> "Test__receive_internal_simple_1720_151";
        "Test__receive_internal_simple_1720_151" -> "Test__receive_internal_simple_1720_153";
        "Test__receive_internal_simple_1720_153" -> "Test__receive_internal_simple_1720_155";
        "Test__receive_internal_simple_1720_155" -> "Test__receive_internal_simple_1720_157";
        "Test__receive_internal_simple_1720_157" -> "Test__receive_internal_simple_1720_159";
        "Test__receive_internal_simple_1720_159" -> "Test__receive_internal_simple_1720_161";
        "Test__receive_internal_simple_1720_161" -> "Test__receive_internal_simple_1720_163";
        "Test__receive_internal_simple_1720_163" -> "Test__receive_internal_simple_1720_165";
    }
}
