test/good/string-receivers-overlap.cfg.mmd
graph TD
subgraph Test__receive_internal_comment_1660_test
end
subgraph Test__receive_internal_simple_1720
    Test__receive_internal_simple_1720_142["if (msg == 'test')"]
    Test__receive_internal_simple_1720_143["if ('test' != msg)"]
    Test__receive_internal_simple_1720_145["if ('test' != msg && WHATEVER)"]
    Test__receive_internal_simple_1720_147["if ((WHATEVER || WHATEVER) && 'test' != msg)"]
    Test__receive_internal_simple_1720_149["let foo: String = msg"]
    Test__receive_internal_simple_1720_151["let bar = foo"]
    Test__receive_internal_simple_1720_153["if ('test' == bar)"]
    Test__receive_internal_simple_1720_155["let test1: String = 'test'"]
    Test__receive_internal_simple_1720_157["let test2 = test1"]
    Test__receive_internal_simple_1720_159["if (test2 == msg)"]
    Test__receive_internal_simple_1720_161["if (test2 != bar)"]
    Test__receive_internal_simple_1720_163["if (bar == test2)"]
    Test__receive_internal_simple_1720_165["if ('test' != a)"]:::exitNode
    Test__receive_internal_simple_1720_142 --> Test__receive_internal_simple_1720_143
    Test__receive_internal_simple_1720_143 --> Test__receive_internal_simple_1720_145
    Test__receive_internal_simple_1720_145 --> Test__receive_internal_simple_1720_147
    Test__receive_internal_simple_1720_147 --> Test__receive_internal_simple_1720_149
    Test__receive_internal_simple_1720_149 --> Test__receive_internal_simple_1720_151
    Test__receive_internal_simple_1720_151 --> Test__receive_internal_simple_1720_153
    Test__receive_internal_simple_1720_153 --> Test__receive_internal_simple_1720_155
    Test__receive_internal_simple_1720_155 --> Test__receive_internal_simple_1720_157
    Test__receive_internal_simple_1720_157 --> Test__receive_internal_simple_1720_159
    Test__receive_internal_simple_1720_159 --> Test__receive_internal_simple_1720_161
    Test__receive_internal_simple_1720_161 --> Test__receive_internal_simple_1720_163
    Test__receive_internal_simple_1720_163 --> Test__receive_internal_simple_1720_165
end
